app/controllers/pessoas_controller.rb

SELECT "pessoas".* FROM "pessoas"
---
  def index
    @pessoas = Pessoa.all

INSERT INTO "pessoas" ("nome", "email", "senha", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", "vagner "], ["email", "vagnerpetz@gmail.com"], ["senha", "teste"], ["created_at", "2015-04-24 02:04:24.633659"], ["updated_at", "2015-04-24 02:04:24.633659"]]
---
  def create
    @pessoa = Pessoa.new(pessoa_params)

    respond_to do |format|
      if @pessoa.save

SELECT  "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_pessoa
      @pessoa = Pessoa.find(params[:id])